In [ ]:
! pip install pyspark

In [ ]:
import pandas as pd
car_dataframe = pd.read_csv(r'/content/car_prices.csv')

from pyspark.sql import SparkSession
from pyspark.sql.types import StructType, StructField, StringType, IntegerType

spark = SparkSession.builder.appName("car_app").getOrCreate()

schema_car = StructType([StructField("year", StringType(), True)
 ,StructField("make", StringType(), True)
 ,StructField("model", StringType(), True)
 ,StructField("trim", StringType(), True)
 ,StructField("body", StringType(), True)
 ,StructField("transmission", StringType(), True)
 ,StructField("vin", StringType(), True)
 ,StructField("state", StringType(), True)
 ,StructField("condition", IntegerType(), True)
 ,StructField("odometer", IntegerType(), True)
 ,StructField("color", StringType(), True)
 ,StructField("interior", StringType(), True)
 ,StructField("seller", StringType(), True)
 ,StructField("mmr", IntegerType(), True)
 ,StructField("sellingprice", IntegerType(), True)
 ,StructField("saledate", StringType(), True)
])
spark_cardataframe = spark.read.option("header", True).csv(r'/content/car_prices.csv',schema=schema_car)
spark_cardataframe.createOrReplaceTempView('car_sales_test')

In [ ]:
spark_cardataframe.printSchema()

In [ ]:
def execquery(query,limit):
  spark.sql(query).show(limit)

In [ ]:
query_string = '''
select * from car_sales_test
where odometer > 1000
order by odometer
;
'''
execquery(query_string,10)

In [ ]:
query_string = '''
select * from car_sales_test
where transmission is not null
order by odometer
;
'''
execquery(query_string,5)

In [ ]:
query_string = '''
select * from car_sales_test
where  odometer > 1000 or make='Nissan'
and transmission is not null
order by odometer
;
'''
execquery(query_string,5)

In [ ]:
query_string = '''
select * from car_sales_test
where  len(body) >5
order by odometer
;
'''
execquery(query_string,5)

In [ ]:
query_string = '''
select * from car_sales_test
where  odometer between 100 and 200
order by odometer
;
'''
execquery(query_string,5)

In [ ]:
query_string = '''
select * from car_sales_test
where  odometer > (select avg(odometer) from car_sales_test)
order by odometer
;
'''
execquery(query_string,5)

In [ ]:
query_string = '''
select year,make,model,first(transmission ignore nulls) from car_sales_test
where  odometer > (select avg(odometer) from car_sales_test)
and make is not null
group by year,make,model
;
'''
execquery(query_string,5)

In [ ]:
query_string = '''
select * from car_sales_test
tablesample (2 rows)
;
'''
execquery(query_string,5)

In [ ]:
query_string = '''
select year,make,model,odometer from car_sales_test
tablesample (10 percent)
where year = '2001'
and odometer > (select avg(odometer) from car_sales_test)
and make is not null
;
'''
execquery(query_string,5)

In [ ]:
query_string = '''
select count(*) from
(
select year,make,model,odometer from car_sales_test
tablesample (bucket 2 out of 10)
)
;
'''
execquery(query_string,100)

In [ ]:
query_string = '''
select count(*) from car_sales_test
;
'''
execquery(query_string,100)

In [ ]:
2/10

In [ ]:
111125/558837

In [ ]:
query_string = '''
explain extended select count(*) from car_sales_test
;
'''
spark.sql(query_string).show(truncate=False)

In [ ]:
query_string = '''
select * from values ('f1','f2',3)
;
'''
execquery(query_string,100)

In [ ]:
query_string = '''
select * from values ('f1','f2',3) as data(year,make,model)
;
'''
execquery(query_string,100)

In [ ]:
query_string = '''
select * from values ('f1','f2',3),('f2','f3',4) as data(year,make,model)
;
'''
execquery(query_string,100)

In [ ]:
query_string = '''
select * from values ('f1','f2',3,array(1,5)),('f2','f3',4,array(2,8))
as data(year,make,model,array)
;
'''
execquery(query_string,100)

In [ ]:
query_string = '''
SELECT * FROM range(5, 10)
;
'''
execquery(query_string,100)

In [ ]:
query_string = '''
SELECT * FROM range(6 + exp(2))
;
'''
execquery(query_string,100)

In [ ]:
query_string = '''
SELECT * FROM range(5,8) as test
;
'''
execquery(query_string,100)

In [ ]:
query_string = '''
SELECT * FROM range(0, 12, 2)
;
'''
execquery(query_string,100)

In [ ]:
query_string = '''
SELECT array(10, 20) as array_values
;
'''
execquery(query_string,100)

In [ ]:
query_string = '''
SELECT explode ( array(10, 20)) as array_values
;
'''
execquery(query_string,100)

In [ ]:
query_string = '''
SELECT posexplode ( array(10, 20)) as (position,value)
;
'''
execquery(query_string,100)

In [ ]:
query_string = '''
select inline(array(struct(1, 'a'), struct(2, 'b'))) as (position,value)
;
'''
execquery(query_string,100)

In [ ]:
query_string = '''
SELECT stack(2,1,2,3,5,6)
;
'''
execquery(query_string,100)

In [ ]:
query_string = '''
SELECT json_tuple('{"a":1, "b":2}', 'a', 'b');
;
'''
execquery(query_string,100)